rule rule1_tf {
        meta:
            author = "securityuser"
            description = "single event rule that should generate detections"

        events:
            $e.metadata.event_type = "FILE_MODIFICATION"

        condition:
            $e
    }
